tests/fixtures/hello/HelloRQ.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
    <ns1:getHelloAsString xmlns:ns1="http://hello/">
      <arg0>chris</arg0>
    </ns1:getHelloAsString>
  </soapenv:Body>
</soapenv:Envelope>
